[
   {
    "title": "Minor Patch",
    "version": "0.406s",
    "date": "August 14, 2022",
    "content": [
      "Minor graphical revamp of the main in-game menu.",
      "You may now 'Favorite' items. Your favorite items do not show up in the Extract/Scrap menus.",
      "Updated the 'Locked!' screen. In addition to the already displayed information, it now also displays your current loadout with some additional stats.",
      "Updated the faction level up screen. The '+' is now greyed out after you've reached max level."
    ],
    "image": ["./patchImg.png"]
   },
   {
    "title": "Minor Patch",
    "version": "0.288s",
    "date": "August 5, 2022",
    "content": [
      "Separated the options for enabling/disabling music and sound.",
      "Added the option to Extract all items of a certain rarity.",
      "Added an option to use multiple Trembling Crystals. Each crystal used further increases the speed.",
      "New item: Mind Soothing Potion. Drink before entering a dungeon to automatically repeat the dungeon upon completion.",
      "Your current score is now shown while in the Halls of Eternity.",
      "Quest NPCs' speech bubbles now have a new icon if there is unread dialogue available.",
      "Toggling show/hide for your HP/MP bar values is now saved between sessions."
    ],
    "image": []
   },
   {
    "title": "Minor Patch",
    "version": "0.280s",
    "date": "July 26, 2022",
    "content": [
      "Added bounty progress and status to the dungeon map.",
      "Bounty screen UI revamp.",
      "Added a Leaderboard to the Halls of Eternity dungeon.",
      "New item: Trembling Crystal. Can be used to speed up time while in a cleared dungeon.",
      "Fixed a bug that caused the Lucidity buff to decrease maximum mana by too much."
    ],
    "image": []
   },
   {
    "title": "Minor Patch",
    "version": "0.259s",
    "date": "July 17, 2022",
    "content": [
      "Decreased the duration of before/after combat animations.",
      "Tuned Light Infusion.",
      "Tuned Food buffs. (10/25/50% -> 10/20/30%)",
      "The screen should no longer turn off due to inactivity while in-game.",
      "New Item: Trinket of Regret - Can be used to redistribute your attributes in exchange for Viridium.",
      "New Dungeon: Halls of Eternity - Endless dungeon, sacrifice Viridium to enter.",
      "Fixed a bug that sometimes caused the first dungeons quest status to be stuck at 3/4.",
      "Tuned late game enemy stats.",
      "New Passive: Open Wound.",
      "Minor UI & graphical fixes."
    ],
    "image": []
   },
   {
    "title": "Minor Patch",
    "version": "0.234s",
    "date": "July 7, 2022",
    "content": [
      "Added additional information to 'Magic' weapons.",
      "Fixed a bug where 'Magic' weapons didn't properly trigger certain bounty progressions.",
      "The amount of Depleted Runes you're carrying is now properly displayed in your inventory.",
      "The last boss will now grow stronger with each consecutive kill. You can track the amount of kills at your 'Stats' screen.",
      "You can now toggle the display of your HP/MP by double tapping your HP/MP bars.",
      "Bounties should now be tracked and updated properly.",
      "The 'Healer' bounty can no longer be completed by eating while at full HP.",
      "'Light Infusion' healing will now count towards the 'Healer' bounty.",
      "Fixed a bug where buffs could sometimes not be tapped.",
      "Fixed a bug where 'Third Time's the Charm' didn't reset when leaving a dungeon.",
      "Tuned mana gained from attacks.",
      "Minor UI changes and fixes."
    ],
    "image": []
   },
   {
    "title": "Minor Patch",
    "version": "0.217s",
    "date": "June 30, 2022",
    "content": [
      "New item: Idol of Amelioration. Use to permanently lower the attribute requirements of items and spell scrolls. This item is given as a reward for reaching grade A in a Challenge Dungeon.",
      "The Viridian Greatsword can now be used if you meet the attribute requirements OR you've reached level 100.",
      "Community Discord Server is now live. To join, tap the Discord button found in the Pause menu in-game, or use this link: https://discord.gg/hjXDvJ73ea",
      "Improved Challenge Dungeon UI and added further information on first entry."
    ],
    "image": []
   },
   {
    "title": "Minor Patch",
    "version": "0.212s",
    "date": "June 24, 2022",
    "content": [
      "Added unique animations to the following spells: Barrier of Light, Holy Sigil, Touch of Light, Arcane Orb, Arcane Barrage, Magi Intus, Arcane Missile, Frozen Exterior, Frozen Blade, Frozen Missile, Light Infusion, Inner Flame, Coat of Iron, Heightened Senses, Exploit Weakspot, Warrior Mindset.",
      "Added Demonic Legate music.",
      "Added Goblin Overseer music.",
      "Added Fat Imp music."
    ],
    "image": []
   },
   {
    "title": "Minor Patch",
    "version": "0.210s",
    "date": "June 19, 2022",
    "content": [
      "The 'Eat' button shown while resting is no longer clickable if you don't have any edible food in your inventory.",
      "Added Goblob, a npc that you can give items you no longer have any use for.",
      "Challenge Dungeons have undergone a lite-rework.",
      "If you find a Spell Scroll, that scroll's spell can now be viewed in the Wizard's spellbook, even if the player hasn't learnt it yet.",
      "Minor graphical tweaks & improvements.",
      "Added Moon-Crazed Beast music."
    ],
    "image": []
   },
   {
    "title": "Minor Patch",
    "version": "0.199s",
    "date": "June 13, 2022",
    "content": [
      "Tuned dodge chance gained from agility.",
      "Shield Absorb effects now reset after defeating an enemy.",
      "Fixed a bug that caused the last boss' attack speed to be incorrect.",
      "Fixed a bug that caused Holy Sigil's heal to be lower than it should.",
      "Reworked lights with a focus on performance.",
      "Minor graphical changes & improvements.",
      "Fixed a bug that sometimes caused the player to walk past enemies after interacting with a npc."
    ],
    "image": []
   },
   {
    "title": "Minor Patch",
    "version": "0.186s",
    "date": "June 10, 2022",
    "content": [
      "Summer has arrived!",
      "Revamped the 'New Dungeon' unlock animation.",
      "Revamped the 'New Menu Button' unlock animation.",
      "In addition to the DPS, the SPD & DMG of weapons is now displayed on the Item Details screen.",
      "Added a Save & Return to Main Menu button to the Pause screen. The Save & Exit button will now quit the game, instead of taking you back to the main menu.",
      "Regarding Execute Rewards; If you're in a cleared dungeon & there is no manual input for 5 seconds, Shards will now be auto selected.",
      "Added a marker to Equipment items that display whether said item is stronger/weaker than the currently equipped item.",
      "Tuned enemy health for all dungeons.",
      "Added buttons for easier movement around the camp.",
      "Added additional information to the Extract Shards screen.",
      "Tuned Metal/Shards/Gems rewards for completing dungeons."
    ],
    "image": []
   },
   {
    "title": "Minor Patch",
    "version": "0.163s",
    "date": "June 1, 2022",
    "content": [
      "New splash screen title graphic.",
      "Fixed a bug where casting a spell with a duration (Light Infusion etc.) while said spell is already active, caused the buff icon to be removed prematurely.",
      "Added a link to the 'Issues' section of our website on the Pause screen.",
      "A settings screen will now be shown the first time the game is launched.",
      "Fixed an inventory bug that sometimes made it so that you couldn't view the details of certain items.",
      "Fixed a bug where quickly exiting the Pause Menu right after switching the sound on/off would cause the sound to not switch properly."
    ],
    "image": []
   },
   {
    "title": "Minor Patch",
    "version": "0.152s",
    "date": "May 31, 2022",
    "content": [
      "Early game item upgrades have received a slight potency increase.",
      "Power up spells such as Light Infusion, Warrior Mindset, etc. will now be displayed as a buff for its active duration.",
      "Fixed a bug where Light Infusion's healing values weren't displayed correctly.",
      "The improvement from upgrading spells/items will now be displayed before upgrading.",
      "Fixed inconsistencies in the UI (font size, position, etc.)",
      "Fixed a bug where interrupting the Star Gaze animation caused the UI to become unresponsive."
    ],
    "image": []
   },
   {
    "title": "Minor Patch",
    "version": "0.144s",
    "date": "May 27, 2022",
    "content": [
      "Tuned Blood Duel. New values: +1 weapon damage per stack, max 10 stacks.",
      "Fixed a inventory visual bug related to Tomes.",
      "Added a Resource (Metal/Gems/Shards) graphic to Smith/Wizard upgrade screens.",
      "Fixed label on Magnus' Steel Cuirass; Epic -> Rare"
    ],
    "image": []
   },
   {
    "title": "Minor Patch",
    "version": "0.142s",
    "date": "May 26, 2022",
    "content": [
      "Optimized inventory performance.",
      "Added unique animations for the following spells: Ice Needle, Firepebble, Burning Blade, Icicle, Fireball, Arcanic Fireball.",
      "Fixed a bug that allowed for infinite cooking.",
      "The effect of the following passives will now be displayed together with other buffs; Momentum, Guiding Light, Light Foot, Mana Surge, Last Resort, Endless Rage, Third Time's the Charm, Golden Spheres, Arcanic Execution, Last Hit, From Mana Life, Holy Blade, The Joy of Combat, Mana Blade, Radiance, Blood Duel, Pursuit of Knowledge, Grace of the Gods, Spoils of War, Keen Eye, Bright Soul.",
      "Reduced movement speed increase from Light Foot passive.",
      "Fixed a bug where the absorption gained from Holy Blade didn't calculate properly while wielding a two-handed weapon.",
      "Tuned Spell Scroll drop rates.",
      "New Smite icon.",
      "New Blood Duel icon.",
      "When nearby a campsite npc, you may now tap to directly initiate conversation. Instead of going through the menu."
    ],
    "image": []
   },
   {
    "title": "Minor Patch",
    "version": "0.134s",
    "date": "May 22, 2022",
    "content": [
      "Added storyline for Kiyo the Old.",
      "Added Troll King music.",
      "Added Touch of Moon Grass buff.",
      "Tuned health regen while resting.",
      "Added storyline for Myra the Wolf.",
      "Added unique animations for the following spells: True Strike, Savage Slash, Minor Arcane Missile.",
      "Fixed a bug where certain spells didn't interact correctly with the Magic Affinity buff.",
      "Fixed a bug where the Mana Surge passive didn't function correctly.",
      "New Flame Imp attack animation.",
      "Slightly altered Hernan the Explorer's questline."
    ],
    "image": []
   },
   {
    "title": "Minor Patch",
    "version": "0.130s",
    "date": "May 14, 2022",
    "content": [
      "On the You Are Dead-screen, you'll now be given the option to revive at the last visited checkpoint. Requires a Smoldering Ember.",
      "While resting at a checkpoint, you may tap the campfire to receive a Smoldering Ember. This action can be performed once per dungeon.",
      "Added a 'Continue' option in the dungeons menu.",
      "Dagger attack damage values have been slightly reduced.",
      "Fixed a bug where, when reaching a checkpoint in the final dungeon, the auto-go-next feature wasn't functioning properly.",
      "Fixed a bug where Heritage npc encounters didn't progress properly.",
      "Fixed a bug where Allegiance npc encounters didn't progress properly.",
      "Slightly increased drop rate of Magic Gem/Metal in low level monsters."
    ],
    "image": []
  },
  {
    "title": "Content Patch",
    "version": "0.115s",
    "date": "May 8, 2022",
    "content": [
      "Added indicator for The Joy of Combat counter.",
      "Added indicator for when Mana Blade is active.",
      "Fixed a visual bug caused by Golden Spheres.",
      "Added Heritage story characters. Interact with them throughout the game to learn additional lore & story.",
      "Reduced gem/shard/metal reward for completing a dungeon.",
      "Tuned Allegiance Dungeon encounters.",
      "Darkened text backgrounds in order to increase readability of npc dialogues.",
      "Challange Dungeon UI has been revamped.",
      "Settings UI has been revamped. (Main Menu & Pause Menu)",
      "Added vibration to certain in-game events. Can be turned on/off in the menu.",
      "Tuned accessories. (Rings, Necklaces etc.) Note: This change only affect newly found items. Existing characters retain their unchanged items.",
      "Upgrading an item will no longer incorrectly display the 'new' graphic.",
      "Item drop rate buffs (Lucky Star, Good Dog, Gone Fishing) has been altered to also increase Shard acquisition."
    ],
    "image": []
  },
  {
    "title": "Minor Patch",
    "version": "0.111s",
    "date": "May 2, 2022",
    "content": [
      "Fixed a bug where Holy Blade would Absorb more damage than it was supposed to.",
      "Fixed a bug where Absorb effects wouldn't reset after exiting the dungeons.",
      "Added a small indicator for when an Absorb effect is active on your character.",
      "Fixed a bug where exiting the game while on the 'You are dead.'-screen caused the player to load in with 0 health."
    ],
    "image": []
  },
  {
    "title": "Minor Patch",
    "version": "0.108s",
    "date": "April 28, 2022",
    "content": [
      "Added graphical detail to the camp.",
      "Added graphical detail to dungeons.",
      "New Item, 'Depleted Rune'. When using a 'Rune of Protection', it will remain in your inventory, as a 'Depleted Rune'. Defeating a boss will recharge the rune, allowing it to be used again.",
      "Fixed a bug where Magic Reflection didn't function properly.",
      "Fixed a bug where item bonuses (Smite, Poison etc.) would persist after unequipping the item with said bonus."
    ],
    "image": []
  },
  {
    "title": "Minor Patch",
    "version": "0.104s",
    "date": "April 23, 2022",
    "content": [
      "Added more scenery & detail to later dungeons.",
      "Cooking QoL improvements.",
      "Minor UI changes."
    ],
    "image": []
  },
  {
    "title": "Minor Patch",
    "version": "0.102s",
    "date": "April 21, 2022",
    "content": [
      "Added rarity border to inventory & equipped items.",
      "Minor UI fixes & optimization.",
      "Fixed a bug where the Trial Edition save file wouldn't transfer correctly to the Full Version."
    ],
    "image": []
  },
  {
    "title": "Minor Patch",
    "version": "0.93s",
    "date": "April 17, 2022",
    "content": [
      "Google Play Instant is now available to supported devices. Press Try Now to instantly jump into the free Trial Edition of The Viridian Obelisk."
    ],
    "image": []
  }
]
